#+TITLE: Pydantic
#+DATE: 2025-04-19 16:50:56
#+DISPLAY: t
#+STARTUP: indent
#+OPTIONS: toc:10
#+AUTHOR: inmove
#+SUBTITLE: Usage of pydantic
#+CATEGORIES: Python

* What is Pydantic

https://docs.pydantic.dev/latest/

Pydantic 是一个数据验证和设置管理库。主要用于数据验证和解析。它有以下优点。

1. 确保输入的数据符合指定的类型和约束条件
2. 自动将数据转换成指定类型
3. 它可以处理Json字典等格式的数据
4. 结合FastAPI等框架，它可以帮助自动生成API文档

#+begin_src python :results output
  from datetime import datetime

  from pydantic import BaseModel, PositiveInt


  class User(BaseModel):
      id: int
      name: str = 'John Doe'
      signup_ts: datetime | None
      tastes: dict[str, PositiveInt]


  external_data = {
      'id': 123,
      'signup_ts': '2019-06-01 12:22',
      'tastes': {
          'wine': 9,
          b'cheese': 7,
          'cabbage': '1',
      },
  }

  user = User(**external_data)

  print(user.id)
  print(user.model_dump())
#+end_src

#+RESULTS:
: 123
: {'id': 123, 'name': 'John Doe', 'signup_ts': datetime.datetime(2019, 6, 1, 12, 22), 'tastes': {'wine': 9, 'cheese': 7, 'cabbage': 1}}

** Some methods and properties
#+begin_src python :results output
  from pydantic import BaseModel


  class User(BaseModel):
      id: int
      name: str = 'Jane Doe'


  user = User(id=1, name="inmove")
  print(User.model_validate({"id": 1, "age": 34}))
  print(User.model_fields)
  print(User.model_post_init)
  print(user.copy())
#+end_src

#+RESULTS:
: id=1 name='Jane Doe'
: {'id': FieldInfo(annotation=int, required=True), 'name': FieldInfo(annotation=str, required=False, default='Jane Doe')}
: <function BaseModel.model_post_init at 0x7fce3b3fa200>
: id=1 name='inmove'

